Revit 2027 API
RibbonPanel.Visible Property
Gets or sets a value indicating whether the RibbonPanel is displayed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
member Visible : bool with get, set
Property Value
Boolean
True if the RibbonPanel is displayed; otherwise, false. The default is true.
See Also
Reference
RibbonPanel Class
Autodesk.Revit.UI Namespace